Reports/Участие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>Участие</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМатча</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ТурнирнаяТаблица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ТурнирнаяТаблица</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Матч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Матч</Name>
			<BasedOn>
				<xr:Item>Catalog.Стадионы</xr:Item>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТурнирнаяТаблица</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стадионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗрителей</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗрителей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пенальти</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Игрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/Участие/Forms/ФормаОтчетаИгрок/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Игрок") Тогда
		Игрок = Параметры.Игрок;
		Элементы.Лига.СписокВыбора.ЗагрузитьЗначения(ЛигиВсеПолучить(Игрок));
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЛигиВсеПолучить(Игрок)
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	МатчСоставыКоманд.Ссылка.Тур.Владелец.Владелец КАК Ссылка
	      	               |ИЗ
	      	               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	      	               |ГДЕ
	      	               |	МатчСоставыКоманд.Игрок = &Игрок
	      	               |	И МатчСоставыКоманд.Ссылка.Проведен = ИСТИНА
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Ссылка
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Игрок",				Игрок);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаСервереБезКонтекста
Функция Цвет(Команда)
	Возврат СерверныйФункции.ЦветКоманды(Команда);
КонецФункции

&НаСервере
Функция УстановитьТочку(Выборка)
	Точка = График.УстановитьТочку(ФорматЧГ(Выборка.Точка));
	Если НЕ ЗначениеЗаполнено(Точка.Расшифровка) Тогда
		Точка.Расшифровка = Выборка.Точка;
	КонецЕсли;
	Возврат Точка;
КонецФункции

&НаСервере
Функция УстановитьСерию(Команда)
	Серия	= График.УстановитьСерию(Команда);
	Если НЕ Серия.ПриоритетЦвета Тогда
		Серия.Расшифровка = Команда;
		Цвет	= Цвет(Команда);
		Если ЗначениеЗаполнено(Цвет) Тогда
			Серия.Цвет			= Цвет;
			Серия.ПриоритетЦвета= Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Серия;
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
	График.Очистить();
	Если НЕ ЗначениеЗаполнено(Игрок) Тогда Возврат; КонецЕсли;
	
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 21
	      	               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
	      	               |	МатчСоставыКоманд.Команда КАК Серия,
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество
	      	               |ИЗ
	      	               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
	      	               |			И МатчСоставыКоманд.Команда = ТурнирнаяТаблица.Команда
	      	               |ГДЕ
	      	               |	МатчСоставыКоманд.Игрок = &Игрок
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	МатчСоставыКоманд.Команда,
	      	               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Точка,
	      	               |	Серия
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Если ЗначениеЗаполнено(Лига) Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 21
		               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		               |	МатчСоставыКоманд.Команда КАК Серия,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество
		               |ИЗ
		               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
		               |			И МатчСоставыКоманд.Команда = ТурнирнаяТаблица.Команда
		               |ГДЕ
		               |	МатчСоставыКоманд.Игрок = &Игрок
		               |	И ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МатчСоставыКоманд.Команда,
		               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Точка,
		               |	Серия
		               |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Лига",				Лига);
	КонецЕсли;
	Запрос.УстановитьПараметр("Игрок",				Игрок);
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		График.УстановитьЗначение(УстановитьТочку(Выборка), УстановитьСерию(Выборка.Серия), Выборка.Количество, Новый Структура("Год,Команда", Выборка.Точка, Выборка.Серия));
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция МатчиПолучить(Параметр)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
	                      |	Матч.Ссылка КАК Значение,
	                      |	Матч.Счет КАК Представление,
	                      |	Матч.Дата КАК Дата
	                      |ИЗ
	                      |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
	                      |		ПО МатчСоставыКоманд.Ссылка = Матч.Ссылка
	                      |ГДЕ
	                      |	МатчСоставыКоманд.Игрок = &Игрок
	                      |	И МатчСоставыКоманд.Команда = &Команда
	                      |	И ГОД(Матч.Тур.Владелец.ДатаОкончания) = &Год
	                      |	И Матч.Проведен = ИСТИНА
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Дата УБЫВ");
	Если ЗначениеЗаполнено(Лига) Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
		               |	Матч.Ссылка КАК Значение,
		               |	Матч.Счет КАК Представление,
		               |	Матч.Дата КАК Дата
		               |ИЗ
		               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
		               |		ПО МатчСоставыКоманд.Ссылка = Матч.Ссылка
		               |ГДЕ
		               |	МатчСоставыКоманд.Игрок = &Игрок
		               |	И МатчСоставыКоманд.Команда = &Команда
		               |	И ГОД(Матч.Тур.Владелец.ДатаОкончания) = &Год
		               |	И Матч.Тур.Владелец.Владелец = &Лига
		               |	И Матч.Проведен = ИСТИНА
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ";
		Запрос.УстановитьПараметр("Лига",				Лига);
	КонецЕсли;
	Запрос.УстановитьПараметр("Игрок",				Игрок);
	Запрос.УстановитьПараметр("Год",				Параметр.Год);
	Запрос.УстановитьПараметр("Команда",			Параметр.Команда);
	Возврат СерверныйФункции.Выборка2СписокЗначений(Запрос.Выполнить().Выбрать());
КонецФункции

&НаСервере
Функция ЛигиПолучить(Параметр)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
	                      |	Матч.Тур.Владелец.Владелец КАК Значение,
	                      |	Матч.Тур.Владелец.Владелец.Наименование КАК Представление
	                      |ИЗ
	                      |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
	                      |		ПО МатчСоставыКоманд.Ссылка = Матч.Ссылка
	                      |ГДЕ
	                      |	МатчСоставыКоманд.Игрок = &Игрок
	                      |	И ГОД(Матч.Тур.Владелец.ДатаОкончания) = &Год
	                      |	И Матч.Проведен = ИСТИНА
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Представление");
	Запрос.УстановитьПараметр("Игрок",				Игрок);
	Запрос.УстановитьПараметр("Год",				Параметр);
	Возврат СерверныйФункции.Выборка2СписокЗначений(Запрос.Выполнить().Выбрать());
КонецФункции

&НаКлиенте
Процедура ПослеВыбора(Элемент, ПараметрКоманды=Неопределено) Экспорт
	Если ТипЗнч(Элемент) = Тип("ЭлементСпискаЗначений")
	И ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Лига")
	Тогда
		Лига = Элемент.Значение;
		СформироватьНаСервере();
	Иначе
		НаКлиенте.Показать(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	Если ТипЗнч(ЗначениеДиаграммы) = Тип("ТочкаДиаграммы") Тогда
		СтандартнаяОбработка = Ложь;
		Список	= ЛигиПолучить(ЗначениеДиаграммы.Расшифровка);
		Если Список.Количество() = 1 Тогда
			ПослеВыбора(Список.Получить(0));
		ИначеЕсли Список.Количество() > 0 Тогда
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), Список);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗначениеДиаграммы.Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Список	= МатчиПолучить(ЗначениеДиаграммы.Расшифровка);
		Если Список.Количество() = 1 Тогда
			ПослеВыбора(Список.Получить(0));
		ИначеЕсли Список.Количество() > 0 Тогда
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), Список);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛигаПриИзменении(Элемент)
	СформироватьНаСервере();
КонецПроцедуры
